analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32690/Include/can_regs.h
/**
 * @file    can_regs.h
 * @brief   Registers, Bit Masks and Bit Positions for the CAN Peripheral Module.
 * @note    This file is @generated.
 * @ingroup can_registers
 */

/******************************************************************************
/******************************************************************************
 *
 * Copyright 2023 Analog Devices, Inc.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 ******************************************************************************
 *
 * Copyright (C) 2022-2023 Maxim Integrated Products, Inc., All Rights Reserved.
 *
 * Permission is hereby granted, free of charge, to any person obtaining a
 * copy of this software and associated documentation files (the "Software"),
 * to deal in the Software without restriction, including without limitation
 * the rights to use, copy, modify, merge, publish, distribute, sublicense,
 * and/or sell copies of the Software, and to permit persons to whom the
 * Software is furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included
 * in all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS
 * OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.
 * IN NO EVENT SHALL MAXIM INTEGRATED BE LIABLE FOR ANY CLAIM, DAMAGES
 * OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE,
 * ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR
 * OTHER DEALINGS IN THE SOFTWARE.
 *
 * Except as contained in this notice, the name of Maxim Integrated
 * Products, Inc. shall not be used except as stated in the Maxim Integrated
 * Products, Inc. Branding Policy.
 *
 * The mere transfer of this software does not imply any licenses
 * of trade secrets, proprietary technology, copyrights, patents,
 * trademarks, maskwork rights, or any other form of intellectual
 * property whatsoever. Maxim Integrated Products, Inc. retains all
 * ownership rights.
 *
 ******************************************************************************/

#ifndef LIBRARIES_CMSIS_DEVICE_MAXIM_MAX32690_INCLUDE_CAN_REGS_H_
#define LIBRARIES_CMSIS_DEVICE_MAXIM_MAX32690_INCLUDE_CAN_REGS_H_

/* **** Includes **** */
#include <stdint.h>

#ifdef __cplusplus
extern "C" {
#endif

#if defined (__ICCARM__)
  #pragma system_include
#endif

#if defined (__CC_ARM)
  #pragma anon_unions
#endif
/// @cond
/*
    If types are not defined elsewhere (CMSIS) define them here
*/
#ifndef __IO
#define __IO volatile
#endif
#ifndef __I
#define __I  volatile const
#endif
#ifndef __O
#define __O  volatile
#endif
#ifndef __R
#define __R  volatile const
#endif
/// @endcond

/* **** Definitions **** */

/**
 * @ingroup     can
 * @defgroup    can_registers CAN_Registers
 * @brief       Registers, Bit Masks and Bit Positions for the CAN Peripheral Module.
 * @details     Controller Area Network Registers
 */

/**
 * @ingroup can_registers
 * Structure type to access the CAN Registers.
 */
typedef struct {
    __IO uint8_t  mode;                 /**< <tt>\b 0x0000:</tt> CAN MODE Register */
    __IO uint8_t  cmd;                  /**< <tt>\b 0x0001:</tt> CAN CMD Register */
    __I  uint8_t  stat;                 /**< <tt>\b 0x0002:</tt> CAN STAT Register */
    __IO uint8_t  intfl;                /**< <tt>\b 0x0003:</tt> CAN INTFL Register */
    __IO uint8_t  inten;                /**< <tt>\b 0x0004:</tt> CAN INTEN Register */
    __IO uint8_t  rmc;                  /**< <tt>\b 0x0005:</tt> CAN RMC Register */
    __IO uint8_t  bustim0;              /**< <tt>\b 0x0006:</tt> CAN BUSTIM0 Register */
    __IO uint8_t  bustim1;              /**< <tt>\b 0x0007:</tt> CAN BUSTIM1 Register */
    union {
        __IO uint32_t txfifo32;         /**< <tt>\b 0x0008:</tt> CAN TXFIFO32 Register */
        __IO uint16_t txfifo16[2];      /**< <tt>\b 0x0008:</tt> CAN TXFIFO16 Register */
        __IO uint8_t  txfifo8[4];       /**< <tt>\b 0x0008:</tt> CAN TXFIFO8 Register */
    };
    union {
        __I  uint32_t rxfifo32;         /**< <tt>\b 0x000C:</tt> CAN RXFIFO32 Register */
        __I  uint16_t rxfifo16[2];      /**< <tt>\b 0x000C:</tt> CAN RXFIFO16 Register */
        __I  uint8_t  rxfifo8[4];       /**< <tt>\b 0x000C:</tt> CAN RXFIFO8 Register */
    };
    union {
        __IO uint32_t acr32;            /**< <tt>\b 0x0010:</tt> CAN ACR32 Register */
        __IO uint16_t acr16[2];         /**< <tt>\b 0x0010:</tt> CAN ACR16 Register */
        __IO uint8_t  acr8[4];          /**< <tt>\b 0x0010:</tt> CAN ACR8 Register */
    };
    union {
        __IO uint32_t amr32;            /**< <tt>\b 0x0014:</tt> CAN AMR32 Register */
        __IO uint16_t amr16[2];         /**< <tt>\b 0x0014:</tt> CAN AMR16 Register */
        __IO uint8_t  amr8[4];          /**< <tt>\b 0x0014:</tt> CAN AMR8 Register */
    };
    __I  uint8_t  ecc;                  /**< <tt>\b 0x0018:</tt> CAN ECC Register */
    __IO uint8_t  rxerr;                /**< <tt>\b 0x0019:</tt> CAN RXERR Register */
    __IO uint8_t  txerr;                /**< <tt>\b 0x001A:</tt> CAN TXERR Register */
    __I  uint8_t  alc;                  /**< <tt>\b 0x001B:</tt> CAN ALC Register */
    __IO uint32_t nbt;                  /**< <tt>\b 0x001C:</tt> CAN NBT Register */
    __IO uint32_t dbt_sspp;             /**< <tt>\b 0x0020:</tt> CAN DBT_SSPP Register */
    __IO uint8_t  fdctrl;               /**< <tt>\b 0x0024:</tt> CAN FDCTRL Register */
    __I  uint8_t  fdstat;               /**< <tt>\b 0x0025:</tt> CAN FDSTAT Register */
    __I  uint8_t  dperr;                /**< <tt>\b 0x0026:</tt> CAN DPERR Register */
    __I  uint8_t  aperr;                /**< <tt>\b 0x0027:</tt> CAN APERR Register */
    __IO uint8_t  test;                 /**< <tt>\b 0x0028:</tt> CAN TEST Register */
    __IO uint8_t  wupclkdiv;            /**< <tt>\b 0x0029:</tt> CAN WUPCLKDIV Register */
    __IO uint16_t wupft;                /**< <tt>\b 0x002A:</tt> CAN WUPFT Register */
    __IO uint32_t wupet;                /**< <tt>\b 0x002C:</tt> CAN WUPET Register */
    __IO uint16_t rxdcnt;               /**< <tt>\b 0x0030:</tt> CAN RXDCNT Register */
    __IO uint8_t  txscnt;               /**< <tt>\b 0x0032:</tt> CAN TXSCNT Register */
    __IO uint8_t  txdecmp;              /**< <tt>\b 0x0033:</tt> CAN TXDECMP Register */
    __IO uint8_t  eintfl;               /**< <tt>\b 0x0034:</tt> CAN EINTFL Register */
    __IO uint8_t  einten;               /**< <tt>\b 0x0035:</tt> CAN EINTEN Register */
    __IO uint16_t rxto;                 /**< <tt>\b 0x0036:</tt> CAN RXTO Register */
} mxc_can_regs_t;

/* Register offsets for module CAN */
/**
 * @ingroup    can_registers
 * @defgroup   CAN_Register_Offsets Register Offsets
 * @brief      CAN Peripheral Register Offsets from the CAN Base Peripheral Address.
 * @{
 */
#define MXC_R_CAN_MODE                     ((uint32_t)0x00000000UL) /**< Offset from CAN Base Address: <tt> 0x0000</tt> */
#define MXC_R_CAN_CMD                      ((uint32_t)0x00000001UL) /**< Offset from CAN Base Address: <tt> 0x0001</tt> */
#define MXC_R_CAN_STAT                     ((uint32_t)0x00000002UL) /**< Offset from CAN Base Address: <tt> 0x0002</tt> */
#define MXC_R_CAN_INTFL                    ((uint32_t)0x00000003UL) /**< Offset from CAN Base Address: <tt> 0x0003</tt> */
#define MXC_R_CAN_INTEN                    ((uint32_t)0x00000004UL) /**< Offset from CAN Base Address: <tt> 0x0004</tt> */
#define MXC_R_CAN_RMC                      ((uint32_t)0x00000005UL) /**< Offset from CAN Base Address: <tt> 0x0005</tt> */
#define MXC_R_CAN_BUSTIM0                  ((uint32_t)0x00000006UL) /**< Offset from CAN Base Address: <tt> 0x0006</tt> */
#define MXC_R_CAN_BUSTIM1                  ((uint32_t)0x00000007UL) /**< Offset from CAN Base Address: <tt> 0x0007</tt> */
#define MXC_R_CAN_TXFIFO32                 ((uint32_t)0x00000008UL) /**< Offset from CAN Base Address: <tt> 0x0008</tt> */
#define MXC_R_CAN_TXFIFO16                 ((uint32_t)0x00000008UL) /**< Offset from CAN Base Address: <tt> 0x0008</tt> */
#define MXC_R_CAN_TXFIFO8                  ((uint32_t)0x00000008UL) /**< Offset from CAN Base Address: <tt> 0x0008</tt> */
#define MXC_R_CAN_RXFIFO32                 ((uint32_t)0x0000000CUL) /**< Offset from CAN Base Address: <tt> 0x000C</tt> */
#define MXC_R_CAN_RXFIFO16                 ((uint32_t)0x0000000CUL) /**< Offset from CAN Base Address: <tt> 0x000C</tt> */
#define MXC_R_CAN_RXFIFO8                  ((uint32_t)0x0000000CUL) /**< Offset from CAN Base Address: <tt> 0x000C</tt> */
#define MXC_R_CAN_ACR32                    ((uint32_t)0x00000010UL) /**< Offset from CAN Base Address: <tt> 0x0010</tt> */
#define MXC_R_CAN_ACR16                    ((uint32_t)0x00000010UL) /**< Offset from CAN Base Address: <tt> 0x0010</tt> */
#define MXC_R_CAN_ACR8                     ((uint32_t)0x00000010UL) /**< Offset from CAN Base Address: <tt> 0x0010</tt> */
#define MXC_R_CAN_AMR32                    ((uint32_t)0x00000014UL) /**< Offset from CAN Base Address: <tt> 0x0014</tt> */
#define MXC_R_CAN_AMR16                    ((uint32_t)0x00000014UL) /**< Offset from CAN Base Address: <tt> 0x0014</tt> */
#define MXC_R_CAN_AMR8                     ((uint32_t)0x00000014UL) /**< Offset from CAN Base Address: <tt> 0x0014</tt> */
#define MXC_R_CAN_ECC                      ((uint32_t)0x00000018UL) /**< Offset from CAN Base Address: <tt> 0x0018</tt> */
#define MXC_R_CAN_RXERR                    ((uint32_t)0x00000019UL) /**< Offset from CAN Base Address: <tt> 0x0019</tt> */
#define MXC_R_CAN_TXERR                    ((uint32_t)0x0000001AUL) /**< Offset from CAN Base Address: <tt> 0x001A</tt> */
#define MXC_R_CAN_ALC                      ((uint32_t)0x0000001BUL) /**< Offset from CAN Base Address: <tt> 0x001B</tt> */
#define MXC_R_CAN_NBT                      ((uint32_t)0x0000001CUL) /**< Offset from CAN Base Address: <tt> 0x001C</tt> */
#define MXC_R_CAN_DBT_SSPP                 ((uint32_t)0x00000020UL) /**< Offset from CAN Base Address: <tt> 0x0020</tt> */
#define MXC_R_CAN_FDCTRL                   ((uint32_t)0x00000024UL) /**< Offset from CAN Base Address: <tt> 0x0024</tt> */
#define MXC_R_CAN_FDSTAT                   ((uint32_t)0x00000025UL) /**< Offset from CAN Base Address: <tt> 0x0025</tt> */
#define MXC_R_CAN_DPERR                    ((uint32_t)0x00000026UL) /**< Offset from CAN Base Address: <tt> 0x0026</tt> */
#define MXC_R_CAN_APERR                    ((uint32_t)0x00000027UL) /**< Offset from CAN Base Address: <tt> 0x0027</tt> */
#define MXC_R_CAN_TEST                     ((uint32_t)0x00000028UL) /**< Offset from CAN Base Address: <tt> 0x0028</tt> */
#define MXC_R_CAN_WUPCLKDIV                ((uint32_t)0x00000029UL) /**< Offset from CAN Base Address: <tt> 0x0029</tt> */
#define MXC_R_CAN_WUPFT                    ((uint32_t)0x0000002AUL) /**< Offset from CAN Base Address: <tt> 0x002A</tt> */
#define MXC_R_CAN_WUPET                    ((uint32_t)0x0000002CUL) /**< Offset from CAN Base Address: <tt> 0x002C</tt> */
#define MXC_R_CAN_RXDCNT                   ((uint32_t)0x00000030UL) /**< Offset from CAN Base Address: <tt> 0x0030</tt> */
#define MXC_R_CAN_TXSCNT                   ((uint32_t)0x00000032UL) /**< Offset from CAN Base Address: <tt> 0x0032</tt> */
#define MXC_R_CAN_TXDECMP                  ((uint32_t)0x00000033UL) /**< Offset from CAN Base Address: <tt> 0x0033</tt> */
#define MXC_R_CAN_EINTFL                   ((uint32_t)0x00000034UL) /**< Offset from CAN Base Address: <tt> 0x0034</tt> */
#define MXC_R_CAN_EINTEN                   ((uint32_t)0x00000035UL) /**< Offset from CAN Base Address: <tt> 0x0035</tt> */
#define MXC_R_CAN_RXTO                     ((uint32_t)0x00000036UL) /**< Offset from CAN Base Address: <tt> 0x0036</tt> */
/**@} end of group can_registers */

/**
 * @ingroup  can_registers
 * @defgroup CAN_MODE CAN_MODE
 * @brief    Mode Register.
 * @{
 */
#define MXC_F_CAN_MODE_AFM_POS                         0 /**< MODE_AFM Position */
#define MXC_F_CAN_MODE_AFM                             ((uint8_t)(0x1UL << MXC_F_CAN_MODE_AFM_POS)) /**< MODE_AFM Mask */

#define MXC_F_CAN_MODE_LOM_POS                         1 /**< MODE_LOM Position */
#define MXC_F_CAN_MODE_LOM                             ((uint8_t)(0x1UL << MXC_F_CAN_MODE_LOM_POS)) /**< MODE_LOM Mask */

#define MXC_F_CAN_MODE_RST_POS                         2 /**< MODE_RST Position */
#define MXC_F_CAN_MODE_RST                             ((uint8_t)(0x1UL << MXC_F_CAN_MODE_RST_POS)) /**< MODE_RST Mask */

#define MXC_F_CAN_MODE_RXTRIG_POS                      3 /**< MODE_RXTRIG Position */
#define MXC_F_CAN_MODE_RXTRIG                          ((uint8_t)(0x7UL << MXC_F_CAN_MODE_RXTRIG_POS)) /**< MODE_RXTRIG Mask */
#define MXC_V_CAN_MODE_RXTRIG_1W                       ((uint8_t)0x0UL) /**< MODE_RXTRIG_1W Value */
#define MXC_S_CAN_MODE_RXTRIG_1W                       (MXC_V_CAN_MODE_RXTRIG_1W << MXC_F_CAN_MODE_RXTRIG_POS) /**< MODE_RXTRIG_1W Setting */
#define MXC_V_CAN_MODE_RXTRIG_4W                       ((uint8_t)0x1UL) /**< MODE_RXTRIG_4W Value */
#define MXC_S_CAN_MODE_RXTRIG_4W                       (MXC_V_CAN_MODE_RXTRIG_4W << MXC_F_CAN_MODE_RXTRIG_POS) /**< MODE_RXTRIG_4W Setting */
#define MXC_V_CAN_MODE_RXTRIG_8W                       ((uint8_t)0x2UL) /**< MODE_RXTRIG_8W Value */
#define MXC_S_CAN_MODE_RXTRIG_8W                       (MXC_V_CAN_MODE_RXTRIG_8W << MXC_F_CAN_MODE_RXTRIG_POS) /**< MODE_RXTRIG_8W Setting */
#define MXC_V_CAN_MODE_RXTRIG_16W                      ((uint8_t)0x3UL) /**< MODE_RXTRIG_16W Value */
#define MXC_S_CAN_MODE_RXTRIG_16W                      (MXC_V_CAN_MODE_RXTRIG_16W << MXC_F_CAN_MODE_RXTRIG_POS) /**< MODE_RXTRIG_16W Setting */
#define MXC_V_CAN_MODE_RXTRIG_32W                      ((uint8_t)0x4UL) /**< MODE_RXTRIG_32W Value */
#define MXC_S_CAN_MODE_RXTRIG_32W                      (MXC_V_CAN_MODE_RXTRIG_32W << MXC_F_CAN_MODE_RXTRIG_POS) /**< MODE_RXTRIG_32W Setting */
#define MXC_V_CAN_MODE_RXTRIG_64W                      ((uint8_t)0x5UL) /**< MODE_RXTRIG_64W Value */
#define MXC_S_CAN_MODE_RXTRIG_64W                      (MXC_V_CAN_MODE_RXTRIG_64W << MXC_F_CAN_MODE_RXTRIG_POS) /**< MODE_RXTRIG_64W Setting */

#define MXC_F_CAN_MODE_DMA_POS                         6 /**< MODE_DMA Position */
#define MXC_F_CAN_MODE_DMA                             ((uint8_t)(0x1UL << MXC_F_CAN_MODE_DMA_POS)) /**< MODE_DMA Mask */

#define MXC_F_CAN_MODE_SLP_POS                         7 /**< MODE_SLP Position */
#define MXC_F_CAN_MODE_SLP                             ((uint8_t)(0x1UL << MXC_F_CAN_MODE_SLP_POS)) /**< MODE_SLP Mask */

/**@} end of group CAN_MODE_Register */

/**
 * @ingroup  can_registers
 * @defgroup CAN_CMD CAN_CMD
 * @brief    Command Register.
 * @{
 */
#define MXC_F_CAN_CMD_ABORT_POS                        1 /**< CMD_ABORT Position */
#define MXC_F_CAN_CMD_ABORT                            ((uint8_t)(0x1UL << MXC_F_CAN_CMD_ABORT_POS)) /**< CMD_ABORT Mask */

#define MXC_F_CAN_CMD_TXREQ_POS                        2 /**< CMD_TXREQ Position */
#define MXC_F_CAN_CMD_TXREQ                            ((uint8_t)(0x1UL << MXC_F_CAN_CMD_TXREQ_POS)) /**< CMD_TXREQ Mask */

/**@} end of group CAN_CMD_Register */

/**
 * @ingroup  can_registers
 * @defgroup CAN_STAT CAN_STAT
 * @brief    Status Register.
 * @{
 */
#define MXC_F_CAN_STAT_BUS_OFF_POS                     0 /**< STAT_BUS_OFF Position */
#define MXC_F_CAN_STAT_BUS_OFF                         ((uint8_t)(0x1UL << MXC_F_CAN_STAT_BUS_OFF_POS)) /**< STAT_BUS_OFF Mask */

#define MXC_F_CAN_STAT_ERR_POS                         1 /**< STAT_ERR Position */
#define MXC_F_CAN_STAT_ERR                             ((uint8_t)(0x1UL << MXC_F_CAN_STAT_ERR_POS)) /**< STAT_ERR Mask */

#define MXC_F_CAN_STAT_TX_POS                          2 /**< STAT_TX Position */
#define MXC_F_CAN_STAT_TX                              ((uint8_t)(0x1UL << MXC_F_CAN_STAT_TX_POS)) /**< STAT_TX Mask */

