analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32690/Include/can_regs.h
#define MXC_F_CAN_STAT_RX_POS                          3 /**< STAT_RX Position */
#define MXC_F_CAN_STAT_RX                              ((uint8_t)(0x1UL << MXC_F_CAN_STAT_RX_POS)) /**< STAT_RX Mask */

#define MXC_F_CAN_STAT_TXBUF_POS                       5 /**< STAT_TXBUF Position */
#define MXC_F_CAN_STAT_TXBUF                           ((uint8_t)(0x1UL << MXC_F_CAN_STAT_TXBUF_POS)) /**< STAT_TXBUF Mask */

#define MXC_F_CAN_STAT_DOR_POS                         6 /**< STAT_DOR Position */
#define MXC_F_CAN_STAT_DOR                             ((uint8_t)(0x1UL << MXC_F_CAN_STAT_DOR_POS)) /**< STAT_DOR Mask */

#define MXC_F_CAN_STAT_RXBUF_POS                       7 /**< STAT_RXBUF Position */
#define MXC_F_CAN_STAT_RXBUF                           ((uint8_t)(0x1UL << MXC_F_CAN_STAT_RXBUF_POS)) /**< STAT_RXBUF Mask */

/**@} end of group CAN_STAT_Register */

/**
 * @ingroup  can_registers
 * @defgroup CAN_INTFL CAN_INTFL
 * @brief    Interrupt Status Register.
 * @{
 */
#define MXC_F_CAN_INTFL_DOR_POS                        0 /**< INTFL_DOR Position */
#define MXC_F_CAN_INTFL_DOR                            ((uint8_t)(0x1UL << MXC_F_CAN_INTFL_DOR_POS)) /**< INTFL_DOR Mask */

#define MXC_F_CAN_INTFL_BERR_POS                       1 /**< INTFL_BERR Position */
#define MXC_F_CAN_INTFL_BERR                           ((uint8_t)(0x1UL << MXC_F_CAN_INTFL_BERR_POS)) /**< INTFL_BERR Mask */

#define MXC_F_CAN_INTFL_TX_POS                         2 /**< INTFL_TX Position */
#define MXC_F_CAN_INTFL_TX                             ((uint8_t)(0x1UL << MXC_F_CAN_INTFL_TX_POS)) /**< INTFL_TX Mask */

#define MXC_F_CAN_INTFL_RX_POS                         3 /**< INTFL_RX Position */
#define MXC_F_CAN_INTFL_RX                             ((uint8_t)(0x1UL << MXC_F_CAN_INTFL_RX_POS)) /**< INTFL_RX Mask */

#define MXC_F_CAN_INTFL_ERPSV_POS                      4 /**< INTFL_ERPSV Position */
#define MXC_F_CAN_INTFL_ERPSV                          ((uint8_t)(0x1UL << MXC_F_CAN_INTFL_ERPSV_POS)) /**< INTFL_ERPSV Mask */

#define MXC_F_CAN_INTFL_ERWARN_POS                     5 /**< INTFL_ERWARN Position */
#define MXC_F_CAN_INTFL_ERWARN                         ((uint8_t)(0x1UL << MXC_F_CAN_INTFL_ERWARN_POS)) /**< INTFL_ERWARN Mask */

#define MXC_F_CAN_INTFL_AL_POS                         6 /**< INTFL_AL Position */
#define MXC_F_CAN_INTFL_AL                             ((uint8_t)(0x1UL << MXC_F_CAN_INTFL_AL_POS)) /**< INTFL_AL Mask */

#define MXC_F_CAN_INTFL_WU_POS                         7 /**< INTFL_WU Position */
#define MXC_F_CAN_INTFL_WU                             ((uint8_t)(0x1UL << MXC_F_CAN_INTFL_WU_POS)) /**< INTFL_WU Mask */

/**@} end of group CAN_INTFL_Register */

/**
 * @ingroup  can_registers
 * @defgroup CAN_INTEN CAN_INTEN
 * @brief    Interrupt Enable Register.
 * @{
 */
#define MXC_F_CAN_INTEN_DOR_POS                        0 /**< INTEN_DOR Position */
#define MXC_F_CAN_INTEN_DOR                            ((uint8_t)(0x1UL << MXC_F_CAN_INTEN_DOR_POS)) /**< INTEN_DOR Mask */

#define MXC_F_CAN_INTEN_BERR_POS                       1 /**< INTEN_BERR Position */
#define MXC_F_CAN_INTEN_BERR                           ((uint8_t)(0x1UL << MXC_F_CAN_INTEN_BERR_POS)) /**< INTEN_BERR Mask */

#define MXC_F_CAN_INTEN_TX_POS                         2 /**< INTEN_TX Position */
#define MXC_F_CAN_INTEN_TX                             ((uint8_t)(0x1UL << MXC_F_CAN_INTEN_TX_POS)) /**< INTEN_TX Mask */

#define MXC_F_CAN_INTEN_RX_POS                         3 /**< INTEN_RX Position */
#define MXC_F_CAN_INTEN_RX                             ((uint8_t)(0x1UL << MXC_F_CAN_INTEN_RX_POS)) /**< INTEN_RX Mask */

#define MXC_F_CAN_INTEN_ERPSV_POS                      4 /**< INTEN_ERPSV Position */
#define MXC_F_CAN_INTEN_ERPSV                          ((uint8_t)(0x1UL << MXC_F_CAN_INTEN_ERPSV_POS)) /**< INTEN_ERPSV Mask */

#define MXC_F_CAN_INTEN_ERWARN_POS                     5 /**< INTEN_ERWARN Position */
#define MXC_F_CAN_INTEN_ERWARN                         ((uint8_t)(0x1UL << MXC_F_CAN_INTEN_ERWARN_POS)) /**< INTEN_ERWARN Mask */

#define MXC_F_CAN_INTEN_AL_POS                         6 /**< INTEN_AL Position */
#define MXC_F_CAN_INTEN_AL                             ((uint8_t)(0x1UL << MXC_F_CAN_INTEN_AL_POS)) /**< INTEN_AL Mask */

#define MXC_F_CAN_INTEN_WU_POS                         7 /**< INTEN_WU Position */
#define MXC_F_CAN_INTEN_WU                             ((uint8_t)(0x1UL << MXC_F_CAN_INTEN_WU_POS)) /**< INTEN_WU Mask */

/**@} end of group CAN_INTEN_Register */

/**
 * @ingroup  can_registers
 * @defgroup CAN_RMC CAN_RMC
 * @brief    Receive Message Counter Register.
 * @{
 */
#define MXC_F_CAN_RMC_NUM_MSGS_POS                     0 /**< RMC_NUM_MSGS Position */
#define MXC_F_CAN_RMC_NUM_MSGS                         ((uint8_t)(0x1FUL << MXC_F_CAN_RMC_NUM_MSGS_POS)) /**< RMC_NUM_MSGS Mask */

/**@} end of group CAN_RMC_Register */

/**
 * @ingroup  can_registers
 * @defgroup CAN_BUSTIM0 CAN_BUSTIM0
 * @brief    Bus Timing Register 0.
 * @{
 */
#define MXC_F_CAN_BUSTIM0_BR_CLKDIV_POS                0 /**< BUSTIM0_BR_CLKDIV Position */
#define MXC_F_CAN_BUSTIM0_BR_CLKDIV                    ((uint8_t)(0x3FUL << MXC_F_CAN_BUSTIM0_BR_CLKDIV_POS)) /**< BUSTIM0_BR_CLKDIV Mask */

#define MXC_F_CAN_BUSTIM0_SJW_POS                      6 /**< BUSTIM0_SJW Position */
#define MXC_F_CAN_BUSTIM0_SJW                          ((uint8_t)(0x3UL << MXC_F_CAN_BUSTIM0_SJW_POS)) /**< BUSTIM0_SJW Mask */

/**@} end of group CAN_BUSTIM0_Register */

/**
 * @ingroup  can_registers
 * @defgroup CAN_BUSTIM1 CAN_BUSTIM1
 * @brief    Bus Timing Register 1.
 * @{
 */
#define MXC_F_CAN_BUSTIM1_TSEG1_POS                    0 /**< BUSTIM1_TSEG1 Position */
#define MXC_F_CAN_BUSTIM1_TSEG1                        ((uint8_t)(0xFUL << MXC_F_CAN_BUSTIM1_TSEG1_POS)) /**< BUSTIM1_TSEG1 Mask */

#define MXC_F_CAN_BUSTIM1_TSEG2_POS                    4 /**< BUSTIM1_TSEG2 Position */
#define MXC_F_CAN_BUSTIM1_TSEG2                        ((uint8_t)(0x7UL << MXC_F_CAN_BUSTIM1_TSEG2_POS)) /**< BUSTIM1_TSEG2 Mask */

#define MXC_F_CAN_BUSTIM1_SAM_POS                      7 /**< BUSTIM1_SAM Position */
#define MXC_F_CAN_BUSTIM1_SAM                          ((uint8_t)(0x1UL << MXC_F_CAN_BUSTIM1_SAM_POS)) /**< BUSTIM1_SAM Mask */

/**@} end of group CAN_BUSTIM1_Register */

/**
 * @ingroup  can_registers
 * @defgroup CAN_TXFIFO32 CAN_TXFIFO32
 * @brief    Transmit FIFO Register.
 * @{
 */
#define MXC_F_CAN_TXFIFO32_DATA_POS                    0 /**< TXFIFO32_DATA Position */
#define MXC_F_CAN_TXFIFO32_DATA                        ((uint32_t)(0xFFFFFFFFUL << MXC_F_CAN_TXFIFO32_DATA_POS)) /**< TXFIFO32_DATA Mask */

/**@} end of group CAN_TXFIFO32_Register */

/**
 * @ingroup  can_registers
 * @defgroup CAN_TXFIFO16 CAN_TXFIFO16
 * @brief    Transmit FIFO Register.
 * @{
 */
#define MXC_F_CAN_TXFIFO16_DATA_POS                    0 /**< TXFIFO16_DATA Position */
#define MXC_F_CAN_TXFIFO16_DATA                        ((uint16_t)(0xFFFFUL << MXC_F_CAN_TXFIFO16_DATA_POS)) /**< TXFIFO16_DATA Mask */

/**@} end of group CAN_TXFIFO16_Register */

/**
 * @ingroup  can_registers
 * @defgroup CAN_TXFIFO8 CAN_TXFIFO8
 * @brief    Transmit FIFO Register.
 * @{
 */
#define MXC_F_CAN_TXFIFO8_DATA_POS                     0 /**< TXFIFO8_DATA Position */
#define MXC_F_CAN_TXFIFO8_DATA                         ((uint8_t)(0xFFUL << MXC_F_CAN_TXFIFO8_DATA_POS)) /**< TXFIFO8_DATA Mask */

/**@} end of group CAN_TXFIFO8_Register */

/**
 * @ingroup  can_registers
 * @defgroup CAN_RXFIFO32 CAN_RXFIFO32
 * @brief    Receive FIFO Register.
 * @{
 */
#define MXC_F_CAN_RXFIFO32_DATA_POS                    0 /**< RXFIFO32_DATA Position */
#define MXC_F_CAN_RXFIFO32_DATA                        ((uint32_t)(0xFFFFFFFFUL << MXC_F_CAN_RXFIFO32_DATA_POS)) /**< RXFIFO32_DATA Mask */

