analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32690/Include/can_regs.h
/**@} end of group CAN_TEST_Register */

/**
 * @ingroup  can_registers
 * @defgroup CAN_WUPCLKDIV CAN_WUPCLKDIV
 * @brief    Wake-up timer prescaler.
 * @{
 */
#define MXC_F_CAN_WUPCLKDIV_WUPDIV_POS                 0 /**< WUPCLKDIV_WUPDIV Position */
#define MXC_F_CAN_WUPCLKDIV_WUPDIV                     ((uint8_t)(0xFFUL << MXC_F_CAN_WUPCLKDIV_WUPDIV_POS)) /**< WUPCLKDIV_WUPDIV Mask */

/**@} end of group CAN_WUPCLKDIV_Register */

/**
 * @ingroup  can_registers
 * @defgroup CAN_WUPFT CAN_WUPFT
 * @brief    Wake up Filter Time Register.
 * @{
 */
#define MXC_F_CAN_WUPFT_WUPFT_POS                      0 /**< WUPFT_WUPFT Position */
#define MXC_F_CAN_WUPFT_WUPFT                          ((uint16_t)(0xFFFFUL << MXC_F_CAN_WUPFT_WUPFT_POS)) /**< WUPFT_WUPFT Mask */

/**@} end of group CAN_WUPFT_Register */

/**
 * @ingroup  can_registers
 * @defgroup CAN_WUPET CAN_WUPET
 * @brief    Wake-up Expire Time Register.
 * @{
 */
#define MXC_F_CAN_WUPET_WUPET_POS                      0 /**< WUPET_WUPET Position */
#define MXC_F_CAN_WUPET_WUPET                          ((uint32_t)(0xFFFFFUL << MXC_F_CAN_WUPET_WUPET_POS)) /**< WUPET_WUPET Mask */

/**@} end of group CAN_WUPET_Register */

/**
 * @ingroup  can_registers
 * @defgroup CAN_RXDCNT CAN_RXDCNT
 * @brief    RX FIFO Data Counter Register.
 * @{
 */
#define MXC_F_CAN_RXDCNT_RXDCNT_POS                    0 /**< RXDCNT_RXDCNT Position */
#define MXC_F_CAN_RXDCNT_RXDCNT                        ((uint16_t)(0xFFFFUL << MXC_F_CAN_RXDCNT_RXDCNT_POS)) /**< RXDCNT_RXDCNT Mask */

/**@} end of group CAN_RXDCNT_Register */

/**
 * @ingroup  can_registers
 * @defgroup CAN_TXSCNT CAN_TXSCNT
 * @brief    TX FIFO Space Counter.
 * @{
 */
#define MXC_F_CAN_TXSCNT_TXSCNT_POS                    0 /**< TXSCNT_TXSCNT Position */
#define MXC_F_CAN_TXSCNT_TXSCNT                        ((uint8_t)(0xFFUL << MXC_F_CAN_TXSCNT_TXSCNT_POS)) /**< TXSCNT_TXSCNT Mask */

/**@} end of group CAN_TXSCNT_Register */

/**
 * @ingroup  can_registers
 * @defgroup CAN_TXDECMP CAN_TXDECMP
 * @brief    Invalidate All Registers.
 * @{
 */
#define MXC_F_CAN_TXDECMP_TDCO_POS                     0 /**< TXDECMP_TDCO Position */
#define MXC_F_CAN_TXDECMP_TDCO                         ((uint8_t)(0x7FUL << MXC_F_CAN_TXDECMP_TDCO_POS)) /**< TXDECMP_TDCO Mask */

#define MXC_F_CAN_TXDECMP_TDCEN_POS                    7 /**< TXDECMP_TDCEN Position */
#define MXC_F_CAN_TXDECMP_TDCEN                        ((uint8_t)(0x1UL << MXC_F_CAN_TXDECMP_TDCEN_POS)) /**< TXDECMP_TDCEN Mask */

/**@} end of group CAN_TXDECMP_Register */

/**
 * @ingroup  can_registers
 * @defgroup CAN_EINTFL CAN_EINTFL
 * @brief    Extended Interrupt Flag Register.
 * @{
 */
#define MXC_F_CAN_EINTFL_RX_THD_POS                    0 /**< EINTFL_RX_THD Position */
#define MXC_F_CAN_EINTFL_RX_THD                        ((uint8_t)(0x1UL << MXC_F_CAN_EINTFL_RX_THD_POS)) /**< EINTFL_RX_THD Mask */

#define MXC_F_CAN_EINTFL_RX_TO_POS                     1 /**< EINTFL_RX_TO Position */
#define MXC_F_CAN_EINTFL_RX_TO                         ((uint8_t)(0x1UL << MXC_F_CAN_EINTFL_RX_TO_POS)) /**< EINTFL_RX_TO Mask */

/**@} end of group CAN_EINTFL_Register */

/**
 * @ingroup  can_registers
 * @defgroup CAN_EINTEN CAN_EINTEN
 * @brief    Extended Interrupt Enable Register.
 * @{
 */
#define MXC_F_CAN_EINTEN_RX_THD_POS                    0 /**< EINTEN_RX_THD Position */
#define MXC_F_CAN_EINTEN_RX_THD                        ((uint8_t)(0x1UL << MXC_F_CAN_EINTEN_RX_THD_POS)) /**< EINTEN_RX_THD Mask */

#define MXC_F_CAN_EINTEN_RX_TO_POS                     1 /**< EINTEN_RX_TO Position */
#define MXC_F_CAN_EINTEN_RX_TO                         ((uint8_t)(0x1UL << MXC_F_CAN_EINTEN_RX_TO_POS)) /**< EINTEN_RX_TO Mask */

/**@} end of group CAN_EINTEN_Register */

/**
 * @ingroup  can_registers
 * @defgroup CAN_RXTO CAN_RXTO
 * @brief    RX FIFO Timeout Register.
 * @{
 */
#define MXC_F_CAN_RXTO_RX_TO_POS                       0 /**< RXTO_RX_TO Position */
#define MXC_F_CAN_RXTO_RX_TO                           ((uint16_t)(0xFFFFUL << MXC_F_CAN_RXTO_RX_TO_POS)) /**< RXTO_RX_TO Mask */

/**@} end of group CAN_RXTO_Register */

#ifdef __cplusplus
}
#endif

#endif // LIBRARIES_CMSIS_DEVICE_MAXIM_MAX32690_INCLUDE_CAN_REGS_H_
